INSERT INTO `sf-admin`.image_space_info (createTime,updateTime,type_id,url,extra) VALUES
	 ('2020-09-24 06:11:00.706996000','2020-09-24 06:11:00.706996000',2,'http://image.si-yee.com/思忆/20200924_021100.png','{"key":"思忆/20200924_021100.png","hash":"FlcrAvWiCZQvsBTU7XKaDwpv0sSF"}'),
	 ('2020-09-24 06:20:44.617766000','2020-09-24 06:20:44.617766000',1,'http://image.si-yee.com/头像/20200924_022044.jpeg','{"key":"头像/20200924_022044.jpeg","hash":"Fikim5OW0KWgyLqRXktE0FqJQr6Y"}');INSERT INTO `sf-admin`.image_space_type (createTime,updateTime,name) VALUES
	 ('2020-09-24 06:04:51.708064000','2020-09-24 06:04:51.708064000','头像'),
	 ('2020-09-24 06:10:36.509527000','2020-09-24 06:10:36.509527000','思忆');INSERT INTO `sf-admin`.sys_department (createTime,updateTime,parend_id,name,order_num) VALUES
	 ('2020-08-27 03:33:19','2020-08-27 03:33:19',NULL,'思忆技术',0),
	 ('2020-09-08 05:31:32.426851000','2020-10-07 04:25:31',1,'管理部门',0);INSERT INTO `sf-admin`.sys_menu (createTime,updateTime,parent_id,name,router,perms,`type`,icon,order_num,view_path,keepalive,isShow) VALUES
	 ('2020-08-28 10:09:26.322745000','2020-10-12 06:35:18',NULL,'系统','/sys',NULL,0,'system',255,NULL,1,1),
	 ('2020-08-01 00:00:00','2020-09-14 03:53:31',1,'权限管理','/sys/permssion',NULL,0,'permission',0,'',1,1),
	 ('2020-08-08 00:00:00','2020-09-08 06:54:45',3,'用户列表','/sys/permssion/user',NULL,1,'peoples',0,'views/system/permission/user',1,1),
	 ('2020-08-15 00:00:00','2020-09-11 06:11:52',4,'新增',NULL,'sys:user:add',2,NULL,0,NULL,1,1),
	 ('2020-08-15 00:00:00','2020-09-11 06:13:03',4,'删除',NULL,'sys:user:delete',2,NULL,0,NULL,1,1),
	 ('2020-08-08 00:00:00','2020-09-24 09:51:40',3,'菜单列表','/sys/permssion/menu',NULL,1,'menu',0,'views/system/permission/menu',1,1),
	 ('2020-08-15 00:00:00','2020-08-15 00:00:00',7,'新增',NULL,'sys:menu:add',2,NULL,0,NULL,1,0),
	 ('2020-08-15 00:00:00','2020-08-15 00:00:00',7,'删除',NULL,'sys:menu:delete',2,NULL,0,NULL,1,1),
	 ('2020-09-02 08:22:27.548410000','2020-09-02 08:22:27.548410000',7,'查询',NULL,'sys:menu:list,sys:menu:info',2,NULL,0,NULL,1,1),
	 ('2020-09-04 06:26:36.408290000','2020-09-04 07:13:30',16,'测试','','sys:menu:list,sys:menu:update,sys:menu:info,sys:menu:add',2,'',0,'',1,1);
INSERT INTO `sf-admin`.sys_menu (createTime,updateTime,parent_id,name,router,perms,`type`,icon,order_num,view_path,keepalive,isShow) VALUES
	 ('2020-09-04 08:08:53.621419000','2020-09-04 08:08:53.621419000',7,'修改','','sys:menu:update',2,'',0,'',1,1),
	 ('2020-09-04 09:41:43.133191000','2020-09-24 09:16:56',3,'角色列表','/sys/permission/role','',1,'role',0,'views/system/permission/role',1,1),
	 ('2020-09-07 02:44:27.663925000','2020-09-07 08:51:18',23,'删除','','sys:role:delete',2,'',0,'',1,1),
	 ('2020-09-07 02:49:36.058795000','2020-09-14 03:56:56',44,'饿了么文档','http://element-cn.eleme.io/#/zh-CN/component/installation','',1,'international',0,'views/charts/keyboard',1,1),
	 ('2020-09-07 02:50:03.345817000','2020-09-14 03:56:47',44,'TypeORM中文文档','https://www.bookstack.cn/read/TypeORM-0.2.20-zh/README.md','',1,'international',2,'views/error-log/components/ErrorTestB',1,1),
	 ('2020-09-07 07:08:18.106272000','2020-09-14 10:26:58',23,'新增','','sys:role:add',2,'',0,'',1,1),
	 ('2020-09-07 08:51:48.319938000','2020-09-07 08:51:58',23,'修改','','sys:role:update',2,'',0,'',1,1),
	 ('2020-09-07 10:39:50.396350000','2020-09-09 06:34:13',23,'查询','','sys:role:list,sys:role:page,sys:role:info',2,'',0,'',1,1),
	 ('2020-09-08 05:29:40.117403000','2020-09-11 06:03:43',4,'部门查询','','sys:dept:list,sys:dept:info',2,'',0,'',1,1),
	 ('2020-09-09 07:10:08.435753000','2020-09-10 03:41:32',4,'查询','','sys:user:page,sys:user:info',2,'',0,'',1,1);
INSERT INTO `sf-admin`.sys_menu (createTime,updateTime,parent_id,name,router,perms,`type`,icon,order_num,view_path,keepalive,isShow) VALUES
	 ('2020-09-10 05:09:31.904519000','2020-09-10 05:09:31.904519000',4,'更新','','sys:user:update',2,'',0,'',1,1),
	 ('2020-09-10 08:02:29.853643000','2020-09-10 08:02:40',4,'部门转移','','sys:dept:transfer',2,'',0,'',1,1),
	 ('2020-09-11 04:34:00.379002000','2020-09-14 03:29:59',1,'系统监控','/sys/monitor','',0,'monitor',0,'',1,1),
	 ('2020-09-11 04:34:52.949262000','2020-10-12 08:14:58',37,'请求追踪','/sys/monitor/log','',1,'log',0,'views/system/monitor/req-log',1,1),
	 ('2020-09-11 06:12:14.621531000','2020-09-11 06:12:14.621531000',4,'部门新增','','sys:dept:add',2,'',0,'',1,1),
	 ('2020-09-11 06:13:23.752133000','2020-09-11 06:13:23.752133000',4,'部门删除','','sys:dept:delete',2,'',0,'',1,1),
	 ('2020-09-11 06:29:52.437621000','2020-09-11 06:29:52.437621000',4,'部门更新','','sys:dept:update',2,'',0,'',1,1),
	 ('2020-09-14 03:56:24.740870000','2020-10-09 07:47:05',NULL,'文档','/document','',0,'documentation',0,'',1,1),
	 ('2020-09-14 06:55:17.544866000','2020-09-24 08:00:12',NULL,'通用权限','/common','',0,'',0,'',1,0),
	 ('2020-09-23 07:31:28.700348000','2020-09-24 05:22:45',45,'图片空间','','space:image:type:list,space:image:type:add,space:image:type:delete,space:image:page,space:image:delete,space:image:upload',2,'',0,'',1,1);
INSERT INTO `sf-admin`.sys_menu (createTime,updateTime,parent_id,name,router,perms,`type`,icon,order_num,view_path,keepalive,isShow) VALUES
	 ('2020-10-12 10:00:49.463487000','2020-10-12 10:00:49.463487000',37,'在线用户','/sys/monitor/online',NULL,1,'people',0,'views/system/monitor/online',1,1),
	 ('2020-10-13 03:01:13.787832000','2020-10-13 03:01:13.787832000',51,'查询','','sys:online:list',2,'',0,'',1,1),
	 ('2020-10-13 03:01:51.480667000','2020-10-13 03:01:51.480667000',51,'下线','','sys:online:kick',2,'',0,'',1,1),
	 ('2020-10-13 09:37:29.097828000','2020-10-13 09:37:29.097828000',38,'查询','','sys:log:req:page,sys:log:req:search',2,'',0,'',1,1),
	 ('2020-10-13 09:52:08.932501000','2020-10-13 09:53:44',37,'登录日志','/sys/monitor/login-log',NULL,1,'guide',0,'views/system/monitor/login-log',1,1),
	 ('2020-10-13 09:56:13.285772000','2020-10-13 09:56:13.285772000',55,'查询','','sys:log:login:page',2,'',0,'',1,1),
	 ('2020-10-19 03:07:18.221647000','2020-10-19 07:26:37',1,'任务调度','/sys/schedule',NULL,0,'task',0,'',1,1),
	 ('2020-10-19 03:08:15.925726000','2020-10-19 07:21:04',57,'定时任务','/sys/schedule/task',NULL,1,'schedule',0,'views/system/schedule/task',1,1),
	 ('2020-10-19 03:08:36.247678000','2020-10-19 03:08:36.247678000',58,'查询','','sys:task:page,sys:task:info',2,'',0,'',1,1),
	 ('2020-10-19 03:09:09.436949000','2020-10-19 03:09:09.436949000',58,'新增','','sys:task:add',2,'',0,'',1,1);
INSERT INTO `sf-admin`.sys_menu (createTime,updateTime,parent_id,name,router,perms,`type`,icon,order_num,view_path,keepalive,isShow) VALUES
	 ('2020-10-19 03:09:42.895534000','2020-10-19 03:09:42.895534000',58,'更新','','sys:task:update',2,'',0,'',1,1),
	 ('2020-10-19 05:45:30.512641000','2020-10-19 05:45:30.512641000',58,'执行一次','','sys:task:once',2,'',0,'',1,1),
	 ('2020-10-19 05:46:01.910857000','2020-10-19 05:46:01.910857000',58,'运行','','sys:task:start',2,'',0,'',1,1),
	 ('2020-10-19 05:46:23.694028000','2020-10-19 05:46:23.694028000',58,'暂停','','sys:task:stop',2,'',0,'',1,1),
	 ('2020-10-19 06:25:52.225518000','2020-10-19 06:25:52.225518000',58,'删除','','sys:task:delete',2,'',0,'',1,1),
	 ('2020-10-19 07:30:18.456330000','2020-10-19 07:30:18.456330000',57,'任务日志','/sys/schedule/log',NULL,1,'schedule-log',0,'views/system/schedule/log',1,1),
	 ('2020-10-19 08:09:49.063343000','2020-10-19 08:09:49.063343000',66,'查询','','sys:log:task:page',2,'',0,'',1,1);INSERT INTO `sf-admin`.sys_role (createTime,updateTime,userId,name,label,remark) VALUES
	 ('2020-08-27 03:35:05','2020-08-27 03:35:05','root','root','超级管理员',NULL),
	 ('2020-09-14 07:39:02.423786000','2020-10-13 07:29:33','1','测试角色','testrole','');INSERT INTO `sf-admin`.sys_role_department (createTime,updateTime,role_id,department_id) VALUES
	 ('2020-09-14 07:39:02.445216000','2020-09-14 07:39:02.445216000',2,1),
	 ('2020-09-14 07:39:02.445216000','2020-09-14 07:39:02.445216000',2,2);INSERT INTO `sf-admin`.sys_role_menu (createTime,updateTime,role_id,menu_id) VALUES
	 ('2020-09-14 07:39:02.432650000','2020-09-14 07:39:02.432650000',2,44),
	 ('2020-09-14 07:39:02.432650000','2020-09-14 07:39:02.432650000',2,26),
	 ('2020-09-14 07:39:02.432650000','2020-09-14 07:39:02.432650000',2,27),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,4),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,33),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,34),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,36),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,39),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,41),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,37);
INSERT INTO `sf-admin`.sys_role_menu (createTime,updateTime,role_id,menu_id) VALUES
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,38),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,43),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,1),
	 ('2020-09-15 08:05:45.986899000','2020-09-15 08:05:45.986899000',2,3),
	 ('2020-09-21 06:29:29.232489000','2020-09-21 06:29:29.232489000',2,8),
	 ('2020-09-21 06:29:29.232489000','2020-09-21 06:29:29.232489000',2,10),
	 ('2020-09-21 06:29:29.232489000','2020-09-21 06:29:29.232489000',2,7),
	 ('2020-10-12 03:22:35.019793000','2020-10-12 03:22:35.019793000',2,45),
	 ('2020-10-12 03:22:35.019793000','2020-10-12 03:22:35.019793000',2,46);INSERT INTO `sf-admin`.sys_task (createTime,updateTime,name,service,`type`,status,start_time,end_time,`limit`,cron,`every`,`data`,job_opts,remark) VALUES
	 ('2020-10-19 08:53:44.732338000','2021-03-17 06:34:19','定时清空请求追踪日志','admin.sys.reqLog.clear',0,1,NULL,NULL,0,'0 0 3 ? * 1',1000,'','{"count":1,"cron":"0 0 3 ? * 1","jobId":1}',''),
	 ('2020-10-19 08:54:42.760785000','2021-03-17 06:34:19','定时清空登录日志','admin.sys.loginLog.clear',0,1,NULL,NULL,0,'0 0 3 ? * 1',0,'','{"count":1,"cron":"0 0 3 ? * 1","jobId":2}',''),
	 ('2020-10-19 08:55:06.050711000','2021-03-17 06:34:19','定时清空任务日志','admin.sys.taskLog.clear',0,1,NULL,NULL,0,'0 0 3 ? * 1',0,'','{"count":1,"cron":"0 0 3 ? * 1","jobId":3}',''),
	 ('2020-10-22 07:48:10.089919000','2020-10-23 04:21:10','获取逆天邪神最新章节','reptile.book.getZonghengBookLastchapter',1,0,NULL,NULL,3,'',20000,'{"id":"408586","emails":"qa894178522@qq.com"}','','');INSERT INTO `sf-admin`.sys_user (createTime,updateTime,department_id,name,username,password,nick_name,head_img,email,phone,remark,status,psalt) VALUES
	 ('2020-08-27 03:38:30','2020-10-07 07:17:14',1,'hackycy','rootadmin','ccdb5f7e5be14fe0c0528974428f79f9','','http://image.si-yee.com/思忆/20200924_021100.png','qa894178522@qq.com','15622472425',NULL,1,'xQYCspvFb8cAW6GG1pOoUGTLqsuUSO3d'),
	 ('2020-09-14 07:41:33.732000000','2020-10-12 06:04:19',2,'hackycy','test001','e2874895736525a9d7a912e9d409a2c2','','','qa894178522@qq.com','','',0,'kuH2z88vsjQ0CtWXOhKohXL94xExCwcD'),
	 ('2020-10-12 03:23:14.611864000','2020-10-12 06:12:20',2,'hackycy','openadmin','ba118b16577ba67aefdcb7eba3610c47','',NULL,'','','',1,'8WF5wLxm7DNBK8O2bKJqdjI9UmsjnF80');INSERT INTO `sf-admin`.sys_user_role (createTime,updateTime,user_id,role_id) VALUES
	 ('2020-09-14 04:10:34.371646000','2020-09-14 04:10:34.371646000',1,1),
	 ('2020-10-12 06:04:19.072876000','2020-10-12 06:04:19.072876000',2,2),
	 ('2020-10-12 06:12:20.149960000','2020-10-12 06:12:20.149960000',3,2);
